MyHome/src/Documents/мх_РегистрацияФизическихУпражений/мх_РегистрацияФизическихУпражений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_РегистрацияФизическихУпражений</name>
  <registerRecords>AccumulationRegister.мх_СтатистикаФизическихУпражнений</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизическиеУпражения</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.мх_ФизическиеУпражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.мх_ПоказателиФизическихУпражнений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_РегистрацияФизическихУпражений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДвиженияДокумента

Функция ТаблицаДвиженийСтатистикаУпражнений(Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Упражнения.Ссылка КАК Регистратор,
	|	РегистрацияФизическихУпражений.Дата КАК Период,
	|	Упражнения.Ссылка.Ответственный КАК Пользователь,
	|	Упражнения.Упражнение,
	|	Упражнения.Показатель,
	|	Упражнения.Количество
	|ИЗ
	|	Документ.мх_РегистрацияФизическихУпражений.ФизическиеУпражения КАК Упражнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.мх_РегистрацияФизическихУпражений КАК РегистрацияФизическихУпражений
	|		ПО Упражнения.Ссылка = РегистрацияФизическихУпражений.Ссылка
	|ГДЕ
	|	Упражнения.Ссылка = &Ссылка";

	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции

Процедура ОтразитьДвиженияСтатистикаУпражненийЭкспорт(Ссылка, Движения, Отказ) Экспорт

	ТаблицаУпражнения = ТаблицаДвиженийСтатистикаУпражнений(Ссылка);

	Если Отказ Или ТаблицаУпражнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияУпражнения = Движения.мх_СтатистикаФизическихУпражнений;
	ДвиженияУпражнения.Записывать = Истина;
	ДвиженияУпражнения.Загрузить(ТаблицаУпражнения);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
